module Bai1(input [4:0]SW, output [0:0]LEDR);
	assign LEDR = 
        // Số 2: 00010
        (~SW[4]&~SW[3]&~SW[2]&SW[1]&~SW[0]) |
        // Số 3: 00011
        (~SW[4]&~SW[3]&~SW[2]&SW[1]&SW[0])|
        // Số 5: 00101
        (~SW[4]&~SW[3]&SW[2]&~SW[1]&SW[0])|
        // Số 7: 00111
        (~SW[4]&~SW[3]&SW[2]&SW[1]&SW[0])|
        // Số 11: 01011
        (~SW[4]&SW[3]&~SW[2]&SW[1]&SW[0])|
        // Số 13: 01101
        (~SW[4]&SW[3]&SW[2]&~SW[1]&SW[0])|
        // Số 17: 10001
        ( SW[4]&~SW[3]&~SW[2]&~SW[1]&SW[0])|
        // Số 19: 10011
        ( SW[4]&~SW[3]&~SW[2]&SW[1]&SW[0])|
        // Số 23: 10111
        ( SW[4]&~SW[3]&SW[2]&SW[1]&SW[0])|
        // Số 29: 11101
        ( SW[4]&SW[3]&SW[2]&~SW[1]&SW[0])|
        // Số 31: 11111
        ( SW[4]&SW[3]&SW[2]&SW[1]&SW[0]);
endmodule